clear all;
%g=6,67*10^(-11);
%M=1.9891*10^30;        % масса Солнца

tau=10000;              %шаг
vx0=0;
gm=13.267297*10^(19);   % в CИ 
vy0=30280;              % скорость в перигелии км/c
%начальные координаты земли относительно Солнца
x0=147098290000;        % расстояние в перигелии, км
y0=0; 

M=365*24*60*2*60/tau;
%M=10000
U(1,1)=x0;
U(1,2)=y0;
U(1,3)=vy0;
U(1,4)=vx0;
%U
figure(1);

method=4; %ERK_: 1,2,3,4

if method==1 %ERK1
    for m=2:M
        w(m-1,1)=U(m-1,4);
        w(m-1,2)=U(m-1,3);
        w(m-1,3)=-gm*U(m-1,2)/((U(m-1,1)^2+U(m-1,2)^2)^(3/2));
        w(m-1,4)=-gm*U(m-1,1)/((U(m-1,1)^2+U(m-1,2)^2)^(3/2));
        for i=1:4
            U(m,i)=U(m-1,i)+tau*w(m-1,i);
        end
    end
end

if method==2 %ERK2
    a2=2/3;
    b1=1/4;
    b2=3/4;
    c1=0;
    c2=0;
    for m=2:M
        w1(m-1,1)=U(m-1,4);
        w1(m-1,2)=U(m-1,3);
        w1(m-1,3)=-gm*U(m-1,2)/((U(m-1,1)^2+U(m-1,2)^2)^(3/2));
        w1(m-1,4)=-gm*U(m-1,1)/((U(m-1,1)^2+U(m-1,2)^2)^(3/2));
        
        Uwn=U+tau*a2*w1;
        
        w2(m-1,1)=Uwn(m-1,4);
        w2(m-1,2)=Uwn(m-1,3);
        w2(m-1,3)=-gm*Uwn(m-1,2)/((Uwn(m-1,1)^2+Uwn(m-1,2)^2)^(3/2));
        w2(m-1,4)=-gm*Uwn(m-1,1)/((Uwn(m-1,1)^2+Uwn(m-1,2)^2)^(3/2));
        for i=1:4
            U(m,i)=U(m-1,i)+tau*(w1(m-1,i)*b1+b2*w2(m-1,i));
        end
    end
end

if method==3 %ERK3
    a2=1/2;
    a3=3/4; 
    b1=2/9;
    b2=3/9;
    b3=4/9;  
    for m=2:M
        w1(m-1,1)=U(m-1,4);
        w1(m-1,2)=U(m-1,3);
        w1(m-1,3)=-gm*U(m-1,2)/((U(m-1,1)^2+U(m-1,2)^2)^(3/2));
        w1(m-1,4)=-gm*U(m-1,1)/((U(m-1,1)^2+U(m-1,2)^2)^(3/2));
        
        Uwn2=U+tau*a2*w1;
        
        w2(m-1,1)=Uwn2(m-1,4);
        w2(m-1,2)=Uwn2(m-1,3);
        w2(m-1,3)=-gm*Uwn2(m-1,2)/((Uwn2(m-1,1)^2+Uwn2(m-1,2)^2)^(3/2));
        w2(m-1,4)=-gm*Uwn2(m-1,1)/((Uwn2(m-1,1)^2+Uwn2(m-1,2)^2)^(3/2));
        
        Uwn3=U+tau*a3*w2;
        
        w3(m-1,1)=Uwn3(m-1,4);
        w3(m-1,2)=Uwn3(m-1,3);
        w3(m-1,3)=-gm*Uwn3(m-1,2)/((Uwn3(m-1,1)^2+Uwn3(m-1,2)^2)^(3/2));
        w3(m-1,4)=-gm*Uwn3(m-1,1)/((Uwn3(m-1,1)^2+Uwn3(m-1,2)^2)^(3/2));
        for i=1:4
            U(m,i)=U(m-1,i)+tau*(w1(m-1,i)*b1+b2*w2(m-1,i)+b3*w3(m-1,i));
        end
    end
end

if method==4 %ERK4
    a2=1/2;
    a3=1/2; 
    a4=1;
    b1=1/6;
    b2=1/3;
    b3=1/3; 
    b4=1/6;
    for m=2:M
        w1(m-1,1)=U(m-1,4);
        w1(m-1,2)=U(m-1,3);
        w1(m-1,3)=-gm*U(m-1,2)/((U(m-1,1)^2+U(m-1,2)^2)^(3/2));
        w1(m-1,4)=-gm*U(m-1,1)/((U(m-1,1)^2+U(m-1,2)^2)^(3/2));
        
        Uwn2=U+tau*a2*w1;
        
        w2(m-1,1)=Uwn2(m-1,4);
        w2(m-1,2)=Uwn2(m-1,3);
        w2(m-1,3)=-gm*Uwn2(m-1,2)/((Uwn2(m-1,1)^2+Uwn2(m-1,2)^2)^(3/2));
        w2(m-1,4)=-gm*Uwn2(m-1,1)/((Uwn2(m-1,1)^2+Uwn2(m-1,2)^2)^(3/2));
        
        Uwn3=U+tau*a3*w2;
        
        w3(m-1,1)=Uwn3(m-1,4);
        w3(m-1,2)=Uwn3(m-1,3);
        w3(m-1,3)=-gm*Uwn3(m-1,2)/((Uwn3(m-1,1)^2+Uwn3(m-1,2)^2)^(3/2));
        w3(m-1,4)=-gm*Uwn3(m-1,1)/((Uwn3(m-1,1)^2+Uwn3(m-1,2)^2)^(3/2));
        
        Uwn4=U+tau*a4*w3;
        
        w4(m-1,1)=Uwn4(m-1,4);
        w4(m-1,2)=Uwn4(m-1,3);
        w4(m-1,3)=-gm*Uwn4(m-1,2)/((Uwn4(m-1,1)^2+Uwn4(m-1,2)^2)^(3/2));
        w4(m-1,4)=-gm*Uwn4(m-1,1)/((Uwn4(m-1,1)^2+Uwn4(m-1,2)^2)^(3/2));
        for i=1:4
            U(m,i)=U(m-1,i)+tau*(w1(m-1,i)*b1+b2*w2(m-1,i)+b3*w3(m-1,i)+b4*w4(m-1,i));
        end
    end
end

earth = plot(U(:,1),U(:,2),'b-');
set(earth,'LineWidth',2);
hold on;
sun = plot(0,0,'y.');
xlim([-1.6 * 10^11 1.6 * 10^11]);
ylim([-1.6 * 10^11 1.6 * 10^11]);
xlabel('X');
ylabel('Y');
title('Вращение Земли вокруг Солнца');
legend('Земля','Солнце');